'''i=0
while i<10:
   print(i)
   i = i + 1
                 #კრავს ციკლს სანამ ი ნაკლებია ათზე და ჩამოწერს მაგ რიცხვებს და პითონ ცოდს კითხულობს ზევიდან ქვემოტ პირველი რაც შეხვდება  ასე რომ
                  #შემოვიდა იური რომელიც  უდრის ნულს დაბეჭდა ნული მერრე მერე წაიკითხა რომ იური უდრის
                  #იურის დამატებული ერთი და დაბეჭდა 1 ახლა იური უდრის
                   #ერთს წაიკითხა რომ იური უდრის იურის დამატებული ერთი დადაბეწდა 2 ანუ ი გახდა 2 და წაყვა თავიდან სანამ ი
                    #გახდება 10 ანუ ი როცა გახდა 9 წაყვება  თავიდან და დაწერს ახალ ის რომელიც უდრის ძველ ის დამატებული 1 მაგრამ
                     #ვაილში ვეღარ შეიტანს რადგან ი ნაკლები უნდა იყო 10 და გაჩერდება '''
'''numbers= "123450987654345"
i=0
while i <len(numbers) :

     print(numbers[i])
     i=i+1'''
''' numbers= "1234567"
i=0
result=0
while i <len(numbers) :                         #itrialebs TviTon numberis sigrdzemde ar wirdeba gansazrvra

  print(result, "\t", numbers[i], i ,"\t" )
  result+= int (numbers[i])                       # =+ ნიშნავს  რესულტ =რესულტ+int (numbers[i])ვუწერთ იმიტო რომ სტრინგი ანუ სტრიქონი გადავაფორმატოტ  
  i=i+1                                      # და ჩავატაროტ მათემატიკური მოქმედებები ნამბერზე რაც გვინდა  '''
''' numbers = "83473984"
for i in numbers:
 print(i)
numbers = "83473984"
for i in range(len(numbers)):   # ბეჭდავს ჩარების ინდექს iwyebs nolidan trials Tavisit randge(0, len(numbers))=range(len(numbers))
 print(i," \t")               # aq igulisxmeba .ინდეხსის ანუ ჩარის საშუალებიტ შეგვიძლია ამოვიღოთ numbersis ელემენტი რომელიც ამ ჩარებზეა
 print(numbers[i],)                  # print(numbers[i]) range უზრუნველყოფ ინკრემნტიზაციას . ფორი ნამბერიდან ამოღებულ თითოულ
                                  # ელემენტს ინახავს ი ში ანუ გადაანიჭებს ნიშვნელობას '''
x=4
y=9
x,y=9,4
print(x,y)









